## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                   |
|--------|-------------------------------------------------------------------------|
| add    | `aws_eks_node_group.notification-canada-ca-eks-secondary-node-group[0]` |
| update | `aws_iam_policy.notification-worker-policy`                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eks_node_group.notification-canada-ca-eks-secondary-node-group[0] will be created
  + resource "aws_eks_node_group" "notification-canada-ca-eks-secondary-node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "notification-canada-ca-production-eks-cluster"
      + disk_size              = (known after apply)
      + force_update_version   = false
      + id                     = (known after apply)
      + instance_types         = [
          + "r5.large",
        ]
      + node_group_name        = "notification-canada-ca-production-eks-secondary-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::296255494825:role/eks-worker-role"
      + release_version        = "1.29.3-20240424"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-09682397146a99c8c",
          + "subnet-0c378ae30f1508687",
          + "subnet-0df02e4de61b0c4a8",
        ]
      + tags                   = {
          + "CostCenter"             = "notification-canada-ca-production"
          + "Name"                   = "notification-canada-ca"
          + "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
      + tags_all               = {
          + "CostCenter"             = "notification-canada-ca-production"
          + "Name"                   = "notification-canada-ca"
          + "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = "lt-0982c75ef73673e77"
          + name    = (known after apply)
          + version = "1"
        }

      + scaling_config {
          + desired_size = 5
          + max_size     = 8
          + min_size     = 3
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_policy.notification-worker-policy will be updated in-place
  ~ resource "aws_iam_policy" "notification-worker-policy" {
        id          = "arn:aws:iam::296255494825:policy/notification-worker-policy"
        name        = "notification-worker-policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            # (4 unchanged elements hidden)
                            "sns:Publish",
                          + "sms-voice:SendTextMessage",
                            "securityhub:BatchImportFindings",
                            # (1 unchanged element hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
